---
kind: enumMember
id: F:Autodesk.Revit.DB.DetachFromCentralOption.DoNotDetach
enum: Autodesk.Revit.DB.DetachFromCentralOption
source: html/4f5d4de3-7c57-890a-e158-329ae1be884b.htm
---
# Autodesk.Revit.DB.DetachFromCentralOption.DoNotDetach

Do not detach the file being opened from its central file.